In [67]:
### Copy and paste top of lab 4 to extract data warehouse and its tables from SQL

import os
import json
import numpy
import datetime
import certifi
import pandas as pd

import pymongo
import sqlalchemy
from sqlalchemy import create_engine, text

print(f"Running SQL Alchemy Version: {sqlalchemy.__version__}")
print(f"Running PyMongo Version: {pymongo.__version__}")

mysql_args = {
    "uid" : "root",
    "pwd" : "Qzk11$soccer15",
    "hostname" : "localhost",
    "dbname" : "adventureworks_dw"
}

def get_sql_dataframe(sql_query, **args):
    '''Connect to MySQL, run a SQL query, and return a DataFrame.'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    dframe = pd.read_sql(text(sql_query), connection)
    connection.close()
    
    return dframe

### Print tables to ensure all 4 were properly extracted from SQL  

df_test = get_sql_dataframe("SHOW TABLES;", **mysql_args)
print(df_test)

Running SQL Alchemy Version: 2.0.39
Running PyMongo Version: 4.15.3
  Tables_in_adventureworks_dw
0                dim_customer
1                    dim_date
2                 dim_product
3                  fact_sales

In [68]:
### Run each of the tables, but display only the first few data using head() to avoid data overload 
### Title each table correspondingly 

df_customer = get_sql_dataframe("SELECT * FROM dim_customer LIMIT 10;", **mysql_args)
df_date = get_sql_dataframe("SELECT * FROM dim_date LIMIT 10;", **mysql_args)
df_product = get_sql_dataframe("SELECT * FROM dim_product LIMIT 10;", **mysql_args)
df_sales = get_sql_dataframe("SELECT * FROM fact_sales LIMIT 10;", **mysql_args)

print("Customer Table")
display(df_customer.head())

print("Date Table")
display(df_date.head())

print("Product Table")
display(df_product.head())

print("Sales Table")
display(df_sales.head())

Customer Table

   customer_key  territory_id account_number customer_type
0             1             1     AW00000001             S
1             2             1     AW00000002             S
2             3             4     AW00000003             S
3             4             4     AW00000004             S
4             5             4     AW00000005             S

Date Table

   date_key   full_date  year  month  day
0  20010701  2001-07-01  2001      7    1
1  20010702  2001-07-02  2001      7    2
2  20010703  2001-07-03  2001      7    3
3  20010704  2001-07-04  2001      7    4
4  20010705  2001-07-05  2001      7    5

Product Table

   product_key           product_name product_number  list_price
0            1        Adjustable Race        AR-5381         0.0
1            2           Bearing Ball        BA-8327         0.0
2            3        BB Ball Bearing        BE-2349         0.0
3            4  Headset Ball Bearings        BE-2908         0.0
4          316                  Blade        BL-2036         0.0

Sales Table

,sales_order_id,product_key,customer_key,date_key,quantity,unit_price,sales_amount
0,43659,776,676,20010701,1,2024.99,2024.99
1,43659,777,676,20010701,3,2024.99,6074.98
2,43659,778,676,20010701,1,2024.99,2024.99
3,43659,771,676,20010701,1,2039.99,2039.99
4,43659,772,676,20010701,1,2039.99,2039.99

In [69]:
from pymongo import MongoClient
import pandas as pd

# Connect to MongoDB and export one table 

mongo_uri = "mongodb+srv://kendallstimart:Roxy2015@cluster1.sso2uqs.mongodb.net/?appName=Cluster1"
client = MongoClient(mongo_uri)

db = client["adventureworks_mongo"]
coll = db["dim_customer"]

if coll.count_documents({}) == 0:
    coll.insert_many(df_customer.to_dict("records"))

sample_docs = list(coll.find().limit(5))
pd.DataFrame(sample_docs)

,_id,customer_key,territory_id,account_number,customer_type
0,691bca88b7435d9cfc53a651,8,5,AW00000008,S
1,691bca88b7435d9cfc53a64a,1,1,AW00000001,S
2,691bca88b7435d9cfc53a64d,4,4,AW00000004,S
3,691bca88b7435d9cfc53a652,9,5,AW00000009,S
4,691bca88b7435d9cfc53a650,7,1,AW00000007,S

In [70]:

import os
import numpy as np
import pandas as pd
import pymongo
import sqlalchemy
from sqlalchemy import create_engine, text

mysql_args = {
    "uid": "root",
    "pwd": "Qzk11$soccer15",
    "hostname": "localhost",
    "dbname": "adventureworks_dw"
}
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:Qzk11$soccer15@localhost/adventureworks_dw")

def get_sql_dataframe(sql_query, **args):
    '''Connect to MySQL, run a SQL query, and return a DataFrame.'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()

    dframe = pd.read_sql(text(sql_query), connection)
    connection.close()
    return dframe
    
df_customer = get_sql_dataframe("SELECT * FROM dim_customer;", **mysql_args)
df_date = get_sql_dataframe("SELECT * FROM dim_date;", **mysql_args)
df_product = get_sql_dataframe("SELECT * FROM dim_product;", **mysql_args)
df_sales = get_sql_dataframe("SELECT * FROM fact_sales;", **mysql_args)

In [71]:
### Add in new csv file from excel (created own table)
df_salesperson = pd.read_csv("dim_salesperson.csv")
display(df_salesperson)

   salesperson_id first_name  last_name
0               1   Jennifer   Connally
1               2    Gerard        Cary
2               3     Lawrie   Freedman
3               4       Mary  Alexander
4               5        Jim      Davis

In [72]:
### Adding MongoDB and CSV file Back into SQL

def get_sql_dataframe(sql_query, **args):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    dframe = pd.read_sql(text(sql_query), connection);
    connection.close()
    
    return dframe
    

def set_dataframe(df, table_name, pk_column, db_operation, **args):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        connection.execute(text(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});"))
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()


def get_mongo_client(**args):
    '''Validate proper input'''
    if args["cluster_location"] not in ['atlas', 'local']:
        raise Exception("You must specify either 'atlas' or 'local' for the cluster_location parameter.")
    
    else:
        if args["cluster_location"] == "atlas":
            connect_str = f"mongodb+srv://{args['user_name']}:{args['password']}@"
            connect_str += f"{args['cluster_name']}.{args['cluster_subnet']}.mongodb.net"
            client = pymongo.MongoClient(connect_str, tlsCAFile=certifi.where())
            
        elif args["cluster_location"] == "local":
            client = pymongo.MongoClient("mongodb://localhost:27017/")
        
    return client

def get_mongo_dataframe(mongo_client, db_name, collection, query):
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = mongo_client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    mongo_client.close()
    
    return dframe


def set_mongo_collections(mongo_client, db_name, data_directory, json_files):
    db = mongo_client[db_name]
    
    for file in json_files:
        db.drop_collection(file)
        json_file = os.path.join(data_directory, json_files[file])
        with open(json_file, 'r') as openfile:
            json_object = json.load(openfile)
            file = db[file]
            result = file.insert_many(json_object)
        
    mongo_client.close()


# This is the dim_customer Mongo Table
df_dim_customer_mongo = pd.DataFrame(list(coll.find()))
df_dim_customer_mongo = df_dim_customer_mongo.drop(columns=["_id"], errors="ignore")

display(df_dim_customer_mongo.head())

df = df_dim_customer_mongo         
table_name = 'mongo_customer'
pk_column = 'customer_key'         
db_operation = "insert"

set_dataframe(df, table_name, pk_column, db_operation, **mysql_args)

   customer_key  territory_id account_number customer_type
0             8             5     AW00000008             S
1             1             1     AW00000001             S
2             4             4     AW00000004             S
3             9             5     AW00000009             S
4             7             1     AW00000007             S

In [73]:
### Export csv table to SQL

df = df_salesperson
table_name = "dim_salesperson"
pk_column = "salesperson_id"
db_operation = "insert"

set_dataframe(dataframe, table_name, primary_key, db_operation, **mysql_args)